In [6]:
import datetime
format = '%Y-%m-%d %H:%M:%S' 
datetime_str = '2020-03-04 05:20:30'
datetime_dt = datetime.datetime.strptime(datetime_str, format)
print(type(datetime_dt))
print(datetime_dt)

<class 'datetime.datetime'>
2020-03-04 05:20:30

In [43]:
datetime.date.today()

datetime.date(2022, 3, 3)

In [2]:
datetime_str = datetime_dt.strftime('%Y-%m-%d %H:%M:%S')

print(type(datetime_str)) # <class 'str'>
print(datetime_str)       # 2018-08-24 18:00:25

<class 'str'>
2018-05-13 12:34:56

In [3]:
datetime_str = datetime_dt.strftime('%Y-%m-%d %H')

print(type(datetime_str)) # <class 'str'>
print(datetime_str)       # 2018-08-24 18:00:25

<class 'str'>
2018-05-13 12

In [4]:
datetime_str = datetime_dt.strftime('%Y-%m')

print(type(datetime_str)) # <class 'str'>
print(datetime_str)       # 2018-08-24 18:00:25

<class 'str'>
2018-05

In [7]:
import pandas as pd

In [10]:
pd.Timestamp(1234.11212212) #defautls to nanoseconds

Timestamp('1970-01-01 00:00:00.000001234')

In [12]:
pd.Timestamp(1234.1112212, unit='D') # change units

Timestamp('1973-05-19 02:40:09.511680')

In [13]:
pd.Timestamp('2019-1-1') # partial strings work

Timestamp('2019-01-01 00:00:00')

In [32]:
pd.Timestamp('2019-1')

Timestamp('2019-01-01 00:00:00')

In [14]:
pd.to_datetime('2019-1-1 12')

Timestamp('2019-01-01 12:00:00')

In [15]:
pd.to_datetime(['2018-1-1', '2019-1-2'])

DatetimeIndex(['2018-01-01', '2019-01-02'], dtype='datetime64[ns]', freq=None)

In [33]:
pd.date_range('2019-01','2019-07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10',
               ...
               '2019-06-22', '2019-06-23', '2019-06-24', '2019-06-25',
               '2019-06-26', '2019-06-27', '2019-06-28', '2019-06-29',
               '2019-06-30', '2019-07-01'],
              dtype='datetime64[ns]', length=182, freq='D')

In [29]:
pd.Period('2019-01')

Period('2019-01', 'M')

In [30]:
pd.Period('2019-05', freq='D')

Period('2019-05-01', 'D')

In [31]:
pd.period_range('2019-01','2019-02',freq='D')

PeriodIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
             '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
             '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12',
             '2019-01-13', '2019-01-14', '2019-01-15', '2019-01-16',
             '2019-01-17', '2019-01-18', '2019-01-19', '2019-01-20',
             '2019-01-21', '2019-01-22', '2019-01-23', '2019-01-24',
             '2019-01-25', '2019-01-26', '2019-01-27', '2019-01-28',
             '2019-01-29', '2019-01-30', '2019-01-31', '2019-02-01'],
            dtype='period[D]')

In [34]:
p = pd.Period('2019-06-13')
test = pd.Timestamp('2019-06-13 22:11')
p.start_time < test < p.end_time

True

In [35]:
p.start_time

Timestamp('2019-06-13 00:00:00')

In [36]:
p.end_time

Timestamp('2019-06-13 23:59:59.999999999')

In [39]:
pd.date_range('2022-03','2022-04',freq='W-FRI')

DatetimeIndex(['2022-03-04', '2022-03-11', '2022-03-18', '2022-03-25',
               '2022-04-01'],
              dtype='datetime64[ns]', freq='W-FRI')

In [47]:
#strings
pd.Timedelta('1 days')
pd.Timedelta('1 days 00:00:00')
pd.Timedelta('1 days 2 hours')
pd.Timedelta('-1 days 2 min 3ns')

Timedelta('-2 days +23:57:59.999999997')

In [48]:
pd.Timestamp('2019-1-1') + pd.Timedelta('1 days 2 hours')

Timestamp('2019-01-02 02:00:00')

In [49]:
pd.Timedelta(days=1, seconds=1)

Timedelta('1 days 00:00:01')

In [50]:
pd.Timedelta(1, unit='d')

Timedelta('1 days 00:00:00')

In [51]:
pd.Timedelta(datetime.timedelta(days=1, seconds=1))

Timedelta('1 days 00:00:01')

In [52]:
import pandas as pd
import numpy as np
s1 = pd.Series([1,np.nan,3,4,5])
s2 = pd.Series([1,2,np.nan,4,5])
s3 = pd.Series([1,2,3,np.nan,5])
df = pd.DataFrame({'S1':s1,
                  'S2':s2,
                  'S3':s3
                  })
df.head()

    S1   S2   S3
0  1.0  1.0  1.0
1  NaN  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [53]:
df['S1'].isna()

0    False
1     True
2    False
3    False
4    False
Name: S1, dtype: bool

In [54]:
df.isna()

      S1     S2     S3
0  False  False  False
1   True  False  False
2  False   True  False
3  False  False   True
4  False  False  False

In [55]:
df.isna().sum()

S1    1
S2    1
S3    1
dtype: int64

In [56]:
df.isna().count

<bound method DataFrame.count of       S1     S2     S3
0  False  False  False
1   True  False  False
2  False   True  False
3  False  False   True
4  False  False  False>

In [57]:
df.dropna(axis=0)

    S1   S2   S3
0  1.0  1.0  1.0
4  5.0  5.0  5.0

In [58]:
df.dropna(axis='rows')

    S1   S2   S3
0  1.0  1.0  1.0
4  5.0  5.0  5.0

In [59]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [60]:
df.dropna(axis='columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [69]:
test = pd.read_csv('./Sales Records.csv')
test.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Sub-Saharan Africa,Chad,Office Supplies,Online,L,1/27/2011,292494523,2/12/2011,4484,651.21,524.96,2920025.64,2353920.64,566105.00
1,Europe,Latvia,Beverages,Online,C,12/28/2015,361825549,1/23/2016,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Middle East and North Africa,Pakistan,Vegetables,Offline,C,1/13/2011,141515767,2/1/2011,6515,154.06,90.93,1003700.90,592408.95,411291.95
3,Sub-Saharan Africa,Democratic Republic of the Congo,Household,Online,C,9/11/2012,500364005,10/6/2012,7683,668.27,502.54,5134318.41,3861014.82,1273303.59
4,Europe,Czech Republic,Beverages,Online,C,10/27/2015,127481591,12/5/2015,3491,47.45,31.79,165647.95,110978.89,54669.06

### 내일 해볼것
    > order id, order priority, slaes channel 컬럼 삭제
    > 컬럼명 수정
    > Country를 기준으로 sort 
    > index값을 초기화

In [70]:
test.isna().sum()

Region            0
Country           0
Item Type         0
Sales Channel     0
Order Priority    0
Order Date        0
Order ID          0
Ship Date         0
Units Sold        0
Unit Price        0
Unit Cost         0
Total Revenue     0
Total Cost        0
Total Profit      0
dtype: int64

In [71]:
test["Total Cost"].describe()

count    1.000000e+04
mean     9.382658e+05
std      1.145914e+06
min      1.245600e+02
25%      1.647855e+05
50%      4.816058e+05
75%      1.183822e+06
max      5.241726e+06
Name: Total Cost, dtype: float64

In [86]:
test_df = test.copy()
test_df["Order Date"] = pd.to_datetime(test_df["Order Date"], format="%m/%d/%Y")
test_df["Ship Date"] = pd.to_datetime(test_df["Ship Date"], format="%m/%d/%Y")
test_df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Sub-Saharan Africa,Chad,Office Supplies,Online,L,2011-01-27,292494523,2011-02-12,4484,651.21,524.96,2920025.64,2353920.64,566105.00
1,Europe,Latvia,Beverages,Online,C,2015-12-28,361825549,2016-01-23,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Middle East and North Africa,Pakistan,Vegetables,Offline,C,2011-01-13,141515767,2011-02-01,6515,154.06,90.93,1003700.90,592408.95,411291.95
3,Sub-Saharan Africa,Democratic Republic of the Congo,Household,Online,C,2012-09-11,500364005,2012-10-06,7683,668.27,502.54,5134318.41,3861014.82,1273303.59
4,Europe,Czech Republic,Beverages,Online,C,2015-10-27,127481591,2015-12-05,3491,47.45,31.79,165647.95,110978.89,54669.06

In [100]:
test_df.columns = ["지역", "국가", "상품타입", "판매채널", "우선순위", "주문날짜", "주문ID", "발송일자", "판매단위", "단가", "원가", "총 수익", "총 비용", "총 이윤"]
test_df

,지역,국가,상품타입,판매채널,우선순위,주문날짜,주문ID,발송일자,판매단위,단가,원가,총 수익,총 비용,총 이윤
0,Sub-Saharan Africa,Chad,Office Supplies,Online,L,2011-01-27,292494523,2011-02-12,4484,651.21,524.96,2920025.64,2353920.64,566105.00
1,Europe,Latvia,Beverages,Online,C,2015-12-28,361825549,2016-01-23,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Middle East and North Africa,Pakistan,Vegetables,Offline,C,2011-01-13,141515767,2011-02-01,6515,154.06,90.93,1003700.90,592408.95,411291.95
3,Sub-Saharan Africa,Democratic Republic of the Congo,Household,Online,C,2012-09-11,500364005,2012-10-06,7683,668.27,502.54,5134318.41,3861014.82,1273303.59
4,Europe,Czech Republic,Beverages,Online,C,2015-10-27,127481591,2015-12-05,3491,47.45,31.79,165647.95,110978.89,54669.06
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,Asia,Laos,Beverages,Online,H,2014-07-15,199342048,2014-07-31,8597,47.45,31.79,407927.65,273298.63,134629.02
9996,Europe,Liechtenstein,Cosmetics,Online,C,2012-10-27,763044106,2012-11-01,562,437.20,263.33,245706.40,147991.46,97714.94
9997,Sub-Saharan Africa,Democratic Republic of the Congo,Vegetables,Offline,M,2013-02-14,848579967,2013-03-20,2524,154.06,90.93,388847.44,229507.32,159340.12
9998,Sub-Saharan Africa,South Africa,Meat,Online,L,2017-02-19,298185956,2017-02-22,8706,421.89,364.69,3672974.34,3174991.14,497983.20
9999,Asia,Mongolia,Snacks,Offline,M,2016-04-12,824410903,2016-04-16,361,152.58,97.44,55081.38,35175.84,19905.54

In [103]:
# 소수점 제거
test_df["총 수익"].astype(int)

0       2920025
1         51008
2       1003700
3       5134318
4        165647
         ...
9995     407927
9996     245706
9997     388847
9998    3672974
9999      55081
Name: 총 수익, Length: 10000, dtype: int32

In [104]:
# 소수점 제거시 반올림
test_df["총 수익"].round(0).astype(int)

0       2920026
1         51009
2       1003701
3       5134318
4        165648
         ...
9995     407928
9996     245706
9997     388847
9998    3672974
9999      55081
Name: 총 수익, Length: 10000, dtype: int32

In [90]:
# round() 반올림 함수
test_df.round(1).head()

,지역,국가,상품타입,판매채널,우선순위,주문날짜,주문ID,발송일자,판매단위,단가,원가,총 수익,총 비용,총 수익
0,Sub-Saharan Africa,Chad,Office Supplies,Online,L,2011-01-27,292494523,2011-02-12,4484,651.2,525.0,2920025.6,2353920.6,566105.0
1,Europe,Latvia,Beverages,Online,C,2015-12-28,361825549,2016-01-23,1075,47.4,31.8,51008.8,34174.2,16834.5
2,Middle East and North Africa,Pakistan,Vegetables,Offline,C,2011-01-13,141515767,2011-02-01,6515,154.1,90.9,1003700.9,592409.0,411292.0
3,Sub-Saharan Africa,Democratic Republic of the Congo,Household,Online,C,2012-09-11,500364005,2012-10-06,7683,668.3,502.5,5134318.4,3861014.8,1273303.6
4,Europe,Czech Republic,Beverages,Online,C,2015-10-27,127481591,2015-12-05,3491,47.4,31.8,165648.0,110978.9,54669.1

In [94]:
test_df["국가"].value_counts()

United Kingdom    72
Lithuania         72
Moldova           71
Seychelles        70
Croatia           70
                  ..
Slovakia          42
Greenland         41
Tajikistan        40
Saint Lucia       39
Mali              35
Name: 국가, Length: 185, dtype: int64

In [107]:
test_df.groupby(["국가", "상품타입"]).sum()["총 이윤"]

국가           상품타입
Afghanistan  Baby Food           131136.48
             Beverages           225190.80
             Cereal             4865097.03
             Clothes            2194901.28
             Cosmetics          2117214.99
                                   ...
Zimbabwe     Meat                551408.00
             Office Supplies    2202683.75
             Personal Care       463058.68
             Snacks              899553.96
             Vegetables         2142947.85
Name: 총 이윤, Length: 2198, dtype: float64

In [108]:
test_df.groupby("국가").get_group("United Kingdom")

,지역,국가,상품타입,판매채널,우선순위,주문날짜,주문ID,발송일자,판매단위,단가,원가,총 수익,총 비용,총 이윤
142,Europe,United Kingdom,Meat,Online,H,2013-12-29,462706220,2014-02-03,3908,421.89,364.69,1648746.12,1425208.52,223537.60
144,Europe,United Kingdom,Office Supplies,Offline,M,2017-06-24,349245774,2017-07-10,8440,651.21,524.96,5496212.40,4430662.40,1065550.00
324,Europe,United Kingdom,Cosmetics,Online,M,2017-04-06,315704858,2017-05-17,2938,437.20,263.33,1284493.60,773663.54,510830.06
387,Europe,United Kingdom,Cosmetics,Offline,L,2016-09-14,815177237,2016-10-16,7914,437.20,263.33,3460000.80,2083993.62,1376007.18
534,Europe,United Kingdom,Clothes,Offline,H,2011-06-29,753352963,2011-08-06,2738,109.28,35.84,299208.64,98129.92,201078.72
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9510,Europe,United Kingdom,Fruits,Offline,L,2010-09-07,739626920,2010-10-18,897,9.33,6.92,8369.01,6207.24,2161.77
9555,Europe,United Kingdom,Office Supplies,Online,H,2011-08-05,282319724,2011-08-18,3535,651.21,524.96,2302027.35,1855733.60,446293.75
9618,Europe,United Kingdom,Cereal,Offline,L,2012-10-22,612341725,2012-10-28,4379,205.70,117.11,900760.30,512824.69,387935.61
9865,Europe,United Kingdom,Baby Food,Offline,C,2014-02-19,871759402,2014-03-07,1834,255.28,159.42,468183.52,292376.28,175807.24
9878,Europe,United Kingdom,Beverages,Offline,C,2015-01-26,208925473,2015-02-01,4545,47.45,31.79,215660.25,144485.55,71174.70